console.log("Самостоятельная оценка работы - 100/100:\
    \n1. Вёрстка валидная (10/10);\
    \n2. Вёрстка семантическая (16/16):\
    \n - <header>, <main>, <footer> (2/2);\
    \n - шесть элементов <section> (2/2);\
    \n - только один заголовок <h1> (2/2);\
    \n - пять заголовков <h2> (2/2);\
    \n - один элемент <nav> (2/2);\
    \n - два списка ul > li > a (2/2);\
    \n - семь кнопок <button> (2/2);\
    \n - два инпута <input> (2/2);\
    \n3. Вёрстка соответствует макету (54/54):\
    \n - блок <header> (8/8);\
    \n - секция Welcome (4/4);\
    \n - секция About (6/6);\
    \n - секция Favorites (8/8);\
    \n - секция CoffeShop (6/6);\
    \n - секция Contacts (6/6);\
    \n - секция LibraryCard (8/8);\
    \n - блок <footer> (8/8);\
    \n4. Общие требования к верстке 20/20:\
    \n - для построения сетки используются флексы или гриды (2/2);\
    \n - при уменьшении масштаба страницы вёрстка размещается по центру (2/2);\
    \n - иконки добавлены в формате .svg (2/2);\
    \n - изображения добавлены в формате .jpg (.jpeg) или .png (2/2);\
    \n - есть favicon (2/2);\
    \n - плавная прокрутка по якорям (2/2);\
    \n - в футере название ссылки Username заменено и ведет на GitHub студента (2/2);\
    \n - в футере ссылка The Rolling Scopes School ведет на страницу курса (2/2);\
    \n - интерактивность элементов согласно макету (2/2);\
    \n - плавное изменение внешнего вида элемента при наведении и клике не влияет на соседние элементы (2/2).\
");