console.log("Итоговая оценка: 200/200\
    \nЭтап 1:\
    \nОграниченная карусель в блоке About:\
    \n1. Карусель реагирует на нажатие кнопок (кнопки под каруселью и стрелочки слева и справа в мобильной версии) и происходит анимация перелистывания. (15/15)\
    \n2. На экране шириной 1440px проверяем, чтобы было доступно 2 других скрытых картинки. При каждом нажатии выезжает следующая, и так до границ справа и слева. (2/2)\
    \n3. Выделенная кнопка под каруселью (имеется ввиду кнопка соответствующая активному слайду и которая имеет коричневый цвет) - неактивная. (2/2)\
    \n4. Если анимация карусели не успела завершиться, при этом нажата была следующая кнопка, то картинка не должна зависнуть в промежуточном состоянии. (2/2)\
    \n5. На экране шириной 768px проверяем, чтобы было доступно 4 других скрытых картинки. Для этого меняем разрешение и перезагружаем страницу. Теперь доступных перемещений становится 5. (2/2)\
    \n6. Неактивными становятся не только выделенные кнопки, но и стрелочки на границах карусели. (2/2)\
    \n\
    \nСлайдер в блоке Favorites:\
    \n1. 'Слайдер' реагирует на нажатие кнопок панели навигации и происходит анимация затухания и проявления. (15/15)\
    \n2. На любой ширине экрана все 4 карточки с книгами одновременно будут плавно затухать, а затем плавно проявляться следующие. (2/2)\
    \n3. Анимация может быть прервана следующим нажатием на кнопку выбора поры года, но при этом анимация не должна застывать в промежуточном состоянии. Если анимация не была прервана следующим нажатием кнопки, то она должна отрабатывать до конца. (2/2)\
    \n4. Во время анимаций высота блока Favorites не должна меняться. (2/2)\
    \n5. Панель навигации 'слайдера' сделана по технологии 'sticky' для разрешений с одним рядом книг (768px и меньше), т.е. опускается вниз вместе со скроллом страницы, прилипая к верхней части экрана, в рамках блока Favorites. (2/2)\
    \n\
    \nДо регистрации:\
    \n1. Нажатие на кнопку Check the card ни к чему не приведёт.\
    \n\
    \nДо авторизации:\
    \n1. Иконка юзера в хедере отображается в виде силуэта.\
    \n2. В блоке Favorites все кнопки должны иметь имя Buy, а не Own. (2/2)\
    \n\
    \nЭтап 2:\
    \nМеню авторизации при нажатии на иконку пользователя:\
    \n1. Нажатие на иконку пользователя в хедере открывает меню, которое должно оказаться под иконкой таким образом, что правый верхний угол меню находится в той же точке, что и нижний правый угол контейнера с иконкой в хедере. Меню под иконкой. (2/2)\
    \n2. На разрешении 768px, при открытом бургер-меню, оно закрывается и открывается меню авторизации. (2/2)\
    \n3. То же верно и в обратную сторону, кнопка бургер-меню должна быть доступна при открытом меню авторизации. (2/2)\
    \n4. Нажатие на любую область или элемент вне меню приводят к закрытию меню авторизации. (2/2)\
    \n\
    \nМодальное окно REGISTER:\
    \n1. Дизайн модального окна соответствует макету. (15/15)\
    \n2. При нажатии на кнопку Register в открытом меню авторизации появляется модальное окно REGISTER, где есть поля First name, Last name, E-mail и Password. (2/2)\
    \n3. При нажатии кнопки Sign Up в блоке Digital Library Cards также появляется модальное окно REGISTER. (2/2)\
    \n4. Окно центрировано, а область вокруг затемнена (насколько затемнена - не имеет значения). (2/2)\
    \n5. При нажатии на крестик в углу окна, или на затемнённую область вне этого окна, оно закрывается. (2/2)\
    \n6. В данном случае, ограничения по полям - все поля должны быть не пустыми. (2/2)\
    \n7. Пароль должен быть не короче 8 символов. (2/2)\
    \n8. В поле E-mail должна быть валидация типа email. (2/2)\
    \n\
    \nОкончание регистрации:\
    \n1. Данные сохраняются в хранилище localStorage, в том числе и пароль, хотя в реальной жизни так делать нельзя. (2/2)\
    \n2. Иконка пользователя меняется на заглавные буквы имени. (2/2)\
    \n3. Отображение страницы приходит в состояние после авторизации (этап 4). (2/2)\
    \n4. Будет сгенерирован девятизначный Card Number случайным образом в формате 16-ричного числа. (2/2)\
    \n5. При наличии регистрации, но будучи не авторизованным:\
    \n6. Блок Digital Library Cards. Если введённые имя и номер карты совпадают с данными пользователя, то отображается панель с информацией, вместо кнопки Check the card на 10 секунд. (2/2)\
    \n7. Там же после отображения информации, кнопка возвращается в прежнее состояние, а поля в форме сбрасываются. (2/2)\
    \n\
    \nЭтап 3:\
    \nМодальное окно LOGIN:\
    \n1. Дизайн модального окна соответствует макету. (15/15)\
    \n2. При нажатии на кнопку Log In появляется модальное окно LOGIN, где есть поля E-mail or readers card и Password. (2/2)\
    \n3. При нажатии кнопки Log In в блоке Digital Library Cards также появляется модальное окно LOGIN. (2/2)\
    \n4. Окно центрировано, а область вокруг затемнена (насколько затемнена - не имеет значения). (2/2)\
    \n5. При нажатии на крестик в углу окна, или на затемнённую область вне этого окна, оно закрывается. (2/2)\
    \n6. Для авторизации все поля должны быть не пустыми. (2/2)\
    \n7. Пароль должен быть не короче 8 символов. (2/2)\
    \n\
    \nБлок Favorites:\
    \n1. Если пользователь ещё не вошёл в учётную запись, то при нажатии на любую кнопку Buy открывается модальное окно LOGIN. (2/2)\
    \n\
    \nЭтап 4:\
    \nМеню профиля при нажатии на иконку с инициалами пользователя:\
    \n1. При наведении курсором на иконку пользователя должно отображаться полное имя пользователя (атрибут title). (2/2)\
    \n2. Нажатие на иконку пользователя в хедере открывает меню, которое должно оказаться под иконкой таким образом, что правый верхний угол меню находится в той же точке, что и нижний правый угол контейнера с иконкой в хедере. Меню под иконкой. (2/2)\
    \n3. На разрешении 768px при открытом бургер-меню, оно закрывается и открывается меню авторизации. (2/2)\
    \n4. То же верно и в обратную сторону, кнопка бургер-меню должна быть доступна. (2/2)\
    \n5. Нажатие на любую область или элемент вне меню приводят к закрытию меню профиля. (2/2)\
    \n6. Вместо надписи Profile отображается девятизначный Card Number. Для Card Number можно использовать меньший шрифт чтобы надпись вметилась в контейнер, (2/2)\
    \n7. Нажатие на кнопку My Profile открывает модальное окно MY PROFILE. (2/2)\
    \n8. Нажатие на кнопку Log Out приводит к выходу пользователю из состояния авторизации, возвращаемся к этапу #1. (2/2)\
    \n\
    \nМодальное окно MY PROFILE:\
    \n1. Дизайн модального окна соответствует макету. (15/15)\
    \n2. В случае если имя и фамилия слишком длинные и не влазят в блок то должен произойти перенос фамилии на следующую строку\
    \n3. Счетчик для Visits отображает, сколько раз пользователь проходил процесс авторизации, включая самый первый - регистрацию. (2/2)\
    \n4. Счетчик для Books отображает, сколько у пользователя книг находятся в состоянии Own. Значение варьируется 0-16. (2/2)\
    \n5. Рядом с Card Number есть кнопка, нажатие на которую копирует код карты клиента в буфер обмена. (2/2)\
    \n6. Окно центрировано, а область вокруг затемнена (насколько затемнена - не имеет значения). (2/2)\
    \n7. При нажатии на крестик в углу окна, или на затемненную область вне этого окна, оно закрывается. (2/2)\
    \n\
    \nБлок Favorites:\
    \n1. При нажатии на любую кнопку Buy, еще до покупки абонемента, открывается модальное окно BUY A LIBRARY CARD. (2/2)\
    \n2. При нажатии на любую кнопку Buy, после покупки абонемента, меняет вид кнопки на неактивную Own, добавляя единицу к счетчику книг в профиле. (2/2)\
    \n3. Кроме того после нажатия обновляется не только счетчик, но и название книги должно отобразится в разделе Rented Books (2/2)\
    \n\
    \nМодальное окно BUY A LIBRARY CARD:\
    \n1. Модальное окно нужно сделать шириной 640px (2/2)\
    \n2. Дизайн модального окна соответствует макету. (15/15)\
    \n3. При нажатии на крестик в углу окна, или на затемнённую область вне этого окна, оно закрывается. (2/2)\
    \n4. Для того, чтобы кнопка Buy была активна, все поля должны быть не пустыми. (2/2)\
    \n5. Bank card number должен содержать 16 цифр. С пробелами каждые 4 символа или нет - значения не имеет. (2/2)\
    \n6. Expiration code содержит 2 поля с ограничением в 2 цифры. (2/2)\
    \n7. CVC должен содержать 3 цифры. (2/2)\
    \n8. После удачного нажатия на кнопку Buy, окно закрывается, и больше мы к нему не возвращаемся\
    \n\
    \nБлок Digital Library Cards:\
    \n1. При наличии авторизации вместо кнопки Check the Card будут отображаться данные пользователя и бейджи, как на дизайне LibraryCard after login in account. (2/2)\
");